import pytest
from src.widget import mask_account_card, get_date


@pytest.mark.parametrize(
    "number, expected_result",
    [
        ("maestro 1596837868705199", "Maestro: 15968 37** **** 199"),
        ("счет 71583007347265484562", "Счет: **4562"),
        ("71583007347265484562", "Введены некорректные данные"),
        ("Visa Platinum 683198247673QRE5", "Введены некорректные данные"),
        ("", "Введены некорректные данные"),
        ("Visa Platinum 5999414228426353", "Visa Platinum: 59994 14** **** 353"),
        ("Visa Gold 5999414228426353", "Visa Gold: 59994 14** **** 353"),
        ("mastercard 7365410843013587", "MasterCard: 73654 10** **** 587"),
        ("Visa Classic 7365410843013587", "Visa Classic: 73654 10** **** 587"),
    ],
)
def test_widget(number, expected_result):
    assert mask_account_card(number) == expected_result


@pytest.mark.parametrize(
    "date, date_result",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("202403-11T02:26:18.671407", "Введены некорректные данные"),
        ("2024-03-11R02:26:18.671407", "Введены некорректные данные"),
        ("", "Введены некорректные данные"),
        ("-03-11T02:26:18.671407", "Введены некорректные данные"),
        ("2024-03-11T02:26:18,671407", "Введены некорректные данные"),
        ("1900-02-29T02:26:18.671400", "Такой даты не существует"),
        ("1800-02-29T02:26:18.671400", "Такой даты не существует"),
        ("2016-02-29T02:26:18.671400", "29.02.2016"),
        ("2032-02-29T02:26:18.671400", "29.02.2032"),
        ("0000-03-11T02:26:18.671407", "Введены некорректные данные"),
        ("2024-00-11T02:26:18.671407", "Введены некорректные данные"),
        ("2024-03-00T02:26:18.671407", "Введены некорректные данные"),
        ("2024-03-11T0226:18671407", "Введены некорректные данные"),
        ("20240311T022618671407", "Введены некорректные данные"),
        ("2024-03-11T02:26:18.671", "Введены некорректные данные"),
    ],
)
def test_get_date(date, date_result):
    assert get_date(date) == date_result
