import pytest
from src.widget import mask_account_card, get_date

@pytest.mark.parametrize("number, expected_result", [
    ('maestro 1596837868705199', 'Maestro: 15968 37** **** 199'),
    ('счет 71583007347265484562', 'Счет: **4562'),
    ('683198247673QRE58', 'Введены некорректные данные'),
    ('', 'Введены некорректные данные'),
    ('Visa Platinum 5999414228426353', 'Visa Platinum: 59994 14** **** 353'),
    ('Visa Gold 5999414228426353','Visa Gold: 59994 14** **** 353')
])
def test_widget(number, expected_result):
    assert mask_account_card(number) == expected_result


@pytest.mark.parametrize("date, date_result", [
    ('2024-03-11T02:26:18.671407', '11.03.2024'),
    ('202403-11T02:26:18.671407', 'Введены некорректные данные'),
    ('2024-03-11R02:26:18.671407', 'Введены некорректные данные'),
    ('', 'Введены некорректные данные'),
    ('-03-11T02:26:18.671407', 'Введены некорректные данные'),
    ('2024-03-11T02:26:18,671407','Введены некорректные данные'),
    ('1900-02-29T02:26:18.671400', 'Такой даты не существует'),
    ('1900-02-29T02:26:18.671400', '29.02.2000'),
    ('2016-02-29T02:26:18.671400', '29.02.2016'),
    ('2032-02-29T02:26:18.671400', '29.02.2032'),

])
def test_get_date(date, date_result):
    assert get_date(date) == date_result